<!doctype html>



  


<html class="theme-next muse use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="title:2016&amp;#x5E74;&amp;#x4E0B;&amp;#x534A;&amp;#x5E74;&amp;#xFF0F;2&amp;#x603B;&amp;#x7ED3;&amp;#x524D;&amp;#x8A00;10.92016&amp;#x5E74;&amp;#x8FC7;&amp;#x53BB;&amp;#x4E86;3&amp;#xFF0F;4&amp;#xFF0C;&amp;#x5230;&amp;#x73B0;&amp;#x5728;&amp;#x53D8;&amp;#x5316;&amp;#x6700;&amp;#x5927;&amp;#">
<meta property="og:type" content="article">
<meta property="og:title" content="Motom 的 秘密树屋">
<meta property="og:url" content="http://yoursite.com/2016/10/09/2016下半年总结/index.html">
<meta property="og:site_name" content="Motom 的 秘密树屋">
<meta property="og:description" content="title:2016&amp;#x5E74;&amp;#x4E0B;&amp;#x534A;&amp;#x5E74;&amp;#xFF0F;2&amp;#x603B;&amp;#x7ED3;&amp;#x524D;&amp;#x8A00;10.92016&amp;#x5E74;&amp;#x8FC7;&amp;#x53BB;&amp;#x4E86;3&amp;#xFF0F;4&amp;#xFF0C;&amp;#x5230;&amp;#x73B0;&amp;#x5728;&amp;#x53D8;&amp;#x5316;&amp;#x6700;&amp;#x5927;&amp;#">
<meta property="og:image" content="http://i1.piimg.com/4851/ac5bd3d8e872ae0c.jpg">
<meta property="og:image" content="http://p1.bqimg.com/4851/2bf708707b74e04b.png">
<meta property="og:updated_time" content="2016-10-28T01:35:28.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Motom 的 秘密树屋">
<meta name="twitter:description" content="title:2016&amp;#x5E74;&amp;#x4E0B;&amp;#x534A;&amp;#x5E74;&amp;#xFF0F;2&amp;#x603B;&amp;#x7ED3;&amp;#x524D;&amp;#x8A00;10.92016&amp;#x5E74;&amp;#x8FC7;&amp;#x53BB;&amp;#x4E86;3&amp;#xFF0F;4&amp;#xFF0C;&amp;#x5230;&amp;#x73B0;&amp;#x5728;&amp;#x53D8;&amp;#x5316;&amp;#x6700;&amp;#x5927;&amp;#">
<meta name="twitter:image" content="http://i1.piimg.com/4851/ac5bd3d8e872ae0c.jpg">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Muse',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://yoursite.com/2016/10/09/2016下半年总结/"/>

  <title>  | Motom 的 秘密树屋 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Motom 的 秘密树屋</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-10-09T10:46:23+08:00" content="2016-10-09">
              2016-10-09
            </time>
          </span>

          

          
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <hr>
<h2 id="title-2016&#x5E74;&#x4E0B;&#x534A;&#x5E74;&#xFF0F;2&#x603B;&#x7ED3;"><a href="#title-2016&#x5E74;&#x4E0B;&#x534A;&#x5E74;&#xFF0F;2&#x603B;&#x7ED3;" class="headerlink" title="title:2016&#x5E74;&#x4E0B;&#x534A;&#x5E74;&#xFF0F;2&#x603B;&#x7ED3;"></a>title:2016&#x5E74;&#x4E0B;&#x534A;&#x5E74;&#xFF0F;2&#x603B;&#x7ED3;</h2><h1 id="&#x524D;&#x8A00;"><a href="#&#x524D;&#x8A00;" class="headerlink" title="&#x524D;&#x8A00;"></a>&#x524D;&#x8A00;</h1><p>10.9<br>2016&#x5E74;&#x8FC7;&#x53BB;&#x4E86;3&#xFF0F;4&#xFF0C;&#x5230;&#x73B0;&#x5728;&#x53D8;&#x5316;&#x6700;&#x5927;&#x7684;&#x5E94;&#x8BE5;&#x662F;&#x81EA;&#x5DF1;&#x771F;&#x6B63;&#x7684;&#x638C;&#x63E1;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x4EBA;&#x751F;&#xFF0C;</p>
<p><img src="http://i1.piimg.com/4851/ac5bd3d8e872ae0c.jpg" alt=""><br>&#x6700;&#x8FD1;&#x5F00;&#x59CB;&#x505A;&#x8BA1;&#x5212;&#x8868;&#x683C;&#xFF0C;&#x5C06;&#x6BCF;&#x4E00;&#x5929;&#x7684;&#x8BA1;&#x5212;&#x90FD;&#x5217;&#x51FA;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x6309;&#x7167;&#x8BA1;&#x5212;&#x53BB;&#x5B8C;&#x6210;&#xFF0C;&#x521A;&#x521A;&#x6B65;&#x5165;&#x5927;&#x56DB;&#xFF0C;&#x751F;&#x6D3B;&#x6765;&#x8BF4;&#xFF0C;&#x53D8;&#x5316;&#x662F;&#x5DE8;&#x5927;&#x7684;&#xFF0C;&#x9996;&#x5148;&#x5728;&#x516C;&#x53F8;&#x5B9E;&#x4E60;&#xFF0C;&#x5F00;&#x59CB;&#x6B65;&#x5165;&#x793E;&#x4F1A;&#xFF0C;&#x5F00;&#x59CB;&#x4E86;&#x65B0;&#x7684;&#x7ADE;&#x4E89;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#xFF0C;&#x5BF9;&#x4E8E;&#x6211;&#x6765;&#x8BF4;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x5904;&#x7684;&#x4F4D;&#x7F6E;&#x5E76;&#x4E0D;&#x662F;&#x6211;&#x60F3;&#x8981;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E48;&#x8BF4;&#xFF0C;&#x5176;&#x5B9E;&#x6BCF;&#x4E2A;&#x7801;&#x519C;&#x5FC3;&#x91CC;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x68A6;&#x60F3;&#xFF0C;&#x6211;&#x7684;&#x68A6;&#x60F3;&#x662F;&#x505A;&#x51FA;&#x4EBA;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#xFF0C;&#x80FD;&#x591F;&#x6539;&#x53D8;&#x751F;&#x6D3B;&#x7684;&#x4E00;&#x6B3E;&#x8F6F;&#x4EF6;&#xFF0C;&#x53C8;&#x6216;&#x8005;&#x662F;&#x4E00;&#x6B3E;&#x80FD;&#x5B9E;&#x73B0;&#x4EBA;&#x5FC3;&#x4E2D;&#x68A6;&#x60F3;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F;&#x817E;&#x8BAF;&#xFF0C;&#x6DD8;&#x5B9D;&#xFF0C;&#x8FD8;&#x662F;&#x767E;&#x5EA6;&#xFF0C;&#x65F6;&#x65F6;&#x523B;&#x523B;&#x5B58;&#x5728;&#x4E8E;&#x751F;&#x6D3B;&#x5F53;&#x4E2D;&#x3002;&#x53EF;&#x80FD;&#x6709;&#x70B9;&#x8BF4;&#x5927;&#x8BDD;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x4F46;&#x5185;&#x5FC3;&#x91CC;&#x771F;&#x7684;&#x60F3;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x68A6;&#x60F3;&#x3002;</p>
<p>&#x4ECA;&#x5E74;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x4E2A;&#x4E8B;&#x4E1A;&#x5E74;&#xFF0C;&#x5DE5;&#x4F5C;&#x5E74;&#xFF0C;&#x4ECE;&#x5E74;&#x5047;&#x56DE;&#x6765;&#x5F00;&#x59CB;&#xFF0C;&#x5C31;&#x4E00;&#x76F4;&#x5728;&#x51C6;&#x5907;&#x5DE5;&#x4F5C;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4E00;&#x76F4;&#x5230;&#x73B0;&#x5728;&#xFF0C;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x5409;&#x4ED6;&#x4E86;&#xFF0C;&#x81EA;&#x5DF1;&#x4EBA;&#x751F;&#x6323;&#x5F97;&#x7B2C;&#x4E00;&#x7B14;&#x94B1; &#x4E70;&#x4E86;&#x4E00;&#x628A;&#x597D;&#x5409;&#x4ED6;&#xFF0C;&#x5C0F;&#x65F6;&#x5019;&#x5C31;&#x60F3;&#x4E70;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x5B66;&#x4E1A;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x7684;&#x7410;&#x4E8B;&#x5C31;&#x4E00;&#x76F4;&#x6401;&#x7F6E;&#xFF0C;&#x73B0;&#x5728;&#x7EC8;&#x4E8E;&#x80FD;&#x591F;&#x5B66;&#x4E00;&#x5B66;&#x5566;&#xFF08;&#x5409;&#x4ED6;&#x4E0D;&#x80FD;&#x5403;&#x7070;&#xFF01;&#xFF09;&#x3002;</p>
<p>&#x4ECA;&#x5E74;&#x8FDB;&#x884C;&#x4E86;&#x4E0D;&#x5C11;&#x9009;&#x62E9;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#x90FD;&#x4F1A;&#x6539;&#x53D8;&#x4EBA;&#x751F;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x6CA1;&#x4EBA;&#x77E5;&#x9053;&#x9009;&#x7684;&#x5BF9;&#x9519;&#xFF0C;&#x4E5F;&#x6CA1;&#x4EBA;&#x77E5;&#x9053;&#x7ED3;&#x679C;&#x5982;&#x4F55;&#xFF0C;&#x552F;&#x4E00;&#x786E;&#x5B9A;&#x7684;&#x662F;&#xFF0C;&#x53EA;&#x8981;&#x9009;&#x62E9;&#xFF0C;&#x603B;&#x4F1A;&#x6709;&#x5931;&#x53BB;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p>ios&#x884C;&#x4E1A;&#x4F3C;&#x4E4E;&#x73B0;&#x5728;&#x7684;&#x201C;&#x884C;&#x60C5;&#x201D;&#x5E76;&#x4E0D;&#x4E50;&#x89C2;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x9009;&#x62E9;ios&#x800C;&#x4E0D;&#x662F;java&#xFF0C;javaweb&#x6216;&#x8005;&#x5176;&#x4ED6;&#x7684;&#x65B9;&#x9762;&#x5462;&#xFF1F; &#x79FB;&#x52A8;&#x7AEF;ios&#x5176;&#x5B9E;&#x4EE3;&#x8868;&#x4E86;&#x4E00;&#x79CD;&#x96C5;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F;app&#x7684;&#x8D28;&#x91CF; &#x8FD8;&#x662F; &#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#x98CE;&#x683C;&#xFF0C;&#x90FD;&#x4F3C;&#x4E4E;&#x975E;&#x5E38;&#x7684;&#x827A;&#x672F;&#xFF0C;&#x656C;&#x4F69;&#x4E54;&#x5E03;&#x65AF;&#xFF0C;&#x5C06;&#x827A;&#x672F;&#x5E26;&#x5165;&#x4E86;&#x79D1;&#x6280;&#x5143;&#x7D20;&#x3002;&#x7136;&#x800C;&#x6211;&#x73B0;&#x5728;&#x53EA;&#x662F;&#x4E2A;&#x7801;&#x519C;&#xFF0C;&#x4ECE;app&#x505A;&#x8D77;&#xFF0C;&#x5E0C;&#x671B;&#x4EE5;&#x540E;&#x80FD;&#x6709;&#x673A;&#x4F1A;&#x6D89;&#x53CA;&#x5230;&#x4EA7;&#x54C1;&#x7684;&#x8BBE;&#x8BA1;&#x4E2D;&#x53BB;&#x3002;</p>
<p>&#x6BD5;&#x4E1A;&#x79BB;&#x6211;&#x4EEC;&#x8D8A;&#x6765;&#x8D8A;&#x8FD1;&#x4E86;&#xFF0C;&#x540C;&#x5B66;&#x627E;&#x5DE5;&#x4F5C;&#x7684;&#x627E;&#x5DE5;&#x4F5C;&#xFF0C;&#x5B9E;&#x4E60;&#x7684;&#x5B9E;&#x4E60;&#xFF0C;&#x5927;&#x5BB6;&#x4F3C;&#x4E4E;&#x90FD;&#x8981;&#x5206;&#x9053;&#x626C;&#x9573;&#x4E86;&#xFF0C;&#x5C31;&#x50CF;&#x6700;&#x8FD1;&#x5F88;&#x706B;&#x7684;&#x4E00;&#x4E2A;&#x7535;&#x5F71;&#xFF0C;&#x300A;&#x4ECE;&#x4F60;&#x7684;&#x5168;&#x4E16;&#x754C;&#x8DEF;&#x8FC7;&#x300B;  &#x6211;&#x4EEC;&#x90FD;&#x662F;&#x8D76;&#x8DEF;&#x7684;&#x4EBA;&#xFF0C;&#x56E0;&#x4E3A;&#x8981;&#x8D70;&#x4E00;&#x6BB5;&#x76F8;&#x540C;&#x7684;&#x8DEF;&#x7A0B;&#xFF0C;&#x4E92;&#x76F8;&#x966A;&#x4F34;&#x524D;&#x884C;&#xFF0C;&#x8FD9;&#x6BB5;&#x8DEF;&#x8D70;&#x5B8C;&#x4E86;&#xFF0C;&#x5927;&#x5BB6;&#x5C31;&#x5404;&#x81EA;&#x8E0F;&#x4E0A;&#x81EA;&#x5DF1;&#x7684;&#x65C5;&#x9014;&#xFF0C;&#x4EE5;&#x540E;&#x8FD8;&#x4F1A;&#x8BA4;&#x8BC6;&#x8BB8;&#x591A;&#x4EBA;&#xFF0C;&#x9047;&#x5230;&#x8BB8;&#x591A;&#x4E8B;&#xFF0C;&#x4F46;&#x518D;&#x4E5F;&#x56DE;&#x4E0D;&#x5230;&#x8FC7;&#x53BB;&#xFF0C;&#x7559;&#x4E0B;&#x7684;&#x53EA;&#x6709;&#x56DE;&#x5FC6;&#x3002;  &#x6709;&#x4E00;&#x53E5;&#x8BDD;&#x8BF4; &#x522B;&#x5984;&#x60F3;&#x628A;&#x773C;&#x524D;&#x7684;&#x98CE;&#x666F;&#xFF0C;&#x53D8;&#x6210;&#x6B64;&#x751F;&#x4E0D;&#x53D8;&#x7684;&#x6C38;&#x6052;&#x3002;&#x6216;&#x8BB8;&#x6211;&#x4EEC;&#x8981;&#x7ECF;&#x5386;&#x4E0D;&#x65AD;&#x544A;&#x522B;&#xFF0C;&#x4E0D;&#x65AD;&#x56DE;&#x5FC6;&#xFF0C;&#x624D;&#x80FD;&#x61C2;&#x5F97;&#x5728;&#x4E00;&#x8D77;&#x90A3;&#x6BB5;&#x65F6;&#x5149;&#x662F;&#x591A;&#x4E48;&#x5F25;&#x8DB3;&#x73CD;&#x8D35;&#x3002;</p>
<p>&#x521D;&#x4E2D;&#x8D77;&#x5C31;&#x5916;&#x51FA;&#x8BFB;&#x4E66;&#xFF0C;&#x521D;&#x4E2D;3&#x5E74;&#xFF0C;&#x9AD8;&#x4E2D;3&#x5E74;&#xFF0C;&#x5927;&#x5B66;4&#x5E74;&#xFF0C;&#x5728;&#x5916;&#x8BFB;&#x4E66;&#x7684;&#x65E5;&#x5B50;&#x770B;&#x6765;&#x591A;&#x591A;&#x5C11;&#x5C11;&#x4E5F;&#x5F71;&#x54CD;&#x5230;&#x4E86;&#x6211;&#xFF0C;&#x7537;&#x5B69;&#x5728;&#x5916;&#x603B;&#x662F;&#x6F02;&#x6CCA;&#xFF0C;&#x72EC;&#x81EA;&#x4E00;&#x4EBA;&#x3002;&#x6709;&#x7684;&#x65F6;&#x5019;&#x5BF9;&#x4E8E;&#x522B;&#x4EBA;&#x7684;&#x5173;&#x5FC3;&#x832B;&#x7136;&#x4E0D;&#x77E5;&#xFF0C;&#x60F3;&#x8D77;&#x4E4B;&#x524D;&#x7684;&#x8BB8;&#x591A;&#x5C0F;&#x4E8B;&#xFF0C;&#x624D;&#x53D1;&#x73B0;&#x4E86;&#x522B;&#x4EBA;&#x7684;&#x597D;&#x3002;</p>
<p>&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;-&#x5206;&#x5272;&#x7EBF;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;</p>
<p>10.27&#x66F4;</p>
<p><img src="http://p1.bqimg.com/4851/2bf708707b74e04b.png" alt=""></p>
<p>&#x5341;&#x6708;&#x4EFD;&#x4F3C;&#x4E4E;&#x6CA1;&#x6709;&#x505A;&#x4EC0;&#x4E48;- - &#xFF0C;1-7&#x53F7;&#x4F11;&#x5047;  &#x4F11;&#x5047;&#x56DE;&#x6765;&#x4E4B;&#x540E;&#x7684;&#x4E00;&#x5468;&#x4E3B;&#x8981;&#x5728;&#x505A;  &#x7B2C;&#x4E8C;&#x4E91;&#x8BFE;&#x5802; &#x9879;&#x76EE;&#xFF0C;&#x5305;&#x62EC;&#x7F16;&#x5199;&#x6587;&#x6863;&#xFF0C;&#x505A;app&#x6548;&#x679C;&#x56FE;&#xFF0C;&#x4EE5;&#x53CA;&#x4EFB;&#x52A1;&#x90E8;&#x7F72;&#xFF0C;&#x5BF9;&#x4E8E;&#x6211;&#x6765;&#x8BF4;&#x662F;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5B66;&#x4E60;&#x673A;&#x4F1A;&#xFF0C;&#x4E5F;&#x80FD;&#x5F00;&#x9614;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x7684;&#x773C;&#x754C;&#xFF0C;&#x53E6;&#x5916;&#x5F00;&#x59CB;&#x63A5;&#x89E6;cocos2d&#xFF0C;&#x5F00;&#x59CB;&#x505A;&#x624B;&#x6E38;&#xFF0C;&#x4F46;&#x662F;&#x5468;&#x4E94;&#x7684;&#x65F6;&#x5019;&#x53D1;&#x70E7;&#xFF0C;&#x8FDE;&#x7EED;&#x70E7;&#x4E86; 3&#xFF0C;4&#x5929;&#xFF0C;&#x8FD9;&#x51E0;&#x5929;&#x51E0;&#x4E4E;&#x4EC0;&#x4E48;&#x90FD;&#x6CA1;&#x505A; &#x5168;&#x7A0B;&#x5212;&#x6C34;&#xFF0C;&#x4E00;&#x76F4;&#x96BE;&#x53D7;&#x8179;&#x6CFB;&#x5934;&#x75DB;&#xFF0C; &#x4E00;&#x4E2A;&#x4EBA;&#x5728;&#x5916;&#x751F;&#x75C5;&#x771F;&#x7684;&#x662F;&#x76F8;&#x5F53;&#x96BE;&#x53D7;&#x7684;&#x1F622;&#x3002;&#x4E5F;&#x957F;&#x4E86;&#x4E00;&#x4E2A;&#x8BB0;&#x6027;&#xFF0C;&#x751F;&#x75C5;&#x4E00;&#x5B9A;&#x8981;&#x7B2C;&#x4E00;&#x65F6;&#x95F4;&#x5403;&#x836F;&#xFF0C;&#x7EDD;&#x5BF9;&#x4E0D;&#x80FD;&#x62D6;&#xFF01;<br>&#x4E4B;&#x540E;&#x4E00;&#x5468;&#x57FA;&#x672C;&#x5728;&#x505A; &#x7B2C;&#x4E8C;&#x4E91;&#x8BFE;&#x5802;&#x7684;&#x4E00;&#x4E9B;&#x6587;&#x6863;&#xFF0C;&#x4FEE;&#x6539;&#xFF0C;&#x4EE5;&#x53CA;&#x4EE3;&#x7801;&#x7684;&#x7F16;&#x5199;&#x5DE5;&#x4F5C;&#xFF0C;&#x987A;&#x5E26;&#x4E5F;&#x505A;&#x4E86;&#x4E00;&#x4E2A;cocos&#x7684;&#x5C0F;&#x6E38;&#x620F;&#x3002;&#x603B;&#x4E4B;&#x770B;&#x56FE;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E2A;&#x6708;&#x4F3C;&#x4E4E;&#x6CA1;&#x6709;&#x4E0A;&#x4E00;&#x4E2A;&#x6708;&#x5145;&#x5B9E;&#x4E00;&#x4E9B;&#xFF0C;&#x75C5;&#x771F;&#x7684;&#x5F88;&#x53EF;&#x6015; &#x5F88;&#x53EF;&#x6015; &#x5F88;&#x53EF;&#x6015;&#x3002;&#x5341;&#x6708;&#x5C31;&#x8FD9;&#x4E48;&#x8FC7;&#x53BB;&#xFF0C;&#x90A3;&#x4E48;&#x63A5;&#x4E0B;&#x6765;&#x7684;11&#x6708;&#x4E00;&#x5B9A;&#x8981;&#x597D;&#x597D;&#x89C4;&#x5212;&#x4E00;&#x4E0B;&#xFF0C;11&#x6708;&#x6CA1;&#x6709;&#x5047;&#x671F;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x4E8B;&#x60C5; &#xFF0C;&#x53EF;&#x4EE5;&#x4E13;&#x5FC3;&#x4E0B;&#x6765;&#x505A;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#x3002; &#x6BCF;&#x4E00;&#x4E2A;&#x9636;&#x6BB5;&#x90FD;&#x5B9A;&#x4E00;&#x4E2A;&#x5C0F;&#x76EE;&#x6807;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;11&#x6708;cocos2d&#x8981;&#x5165;&#x95E8;&#xFF0C;&#x5E76;&#x4E14;11&#x6708;&#x53D1;&#x5E03;&#x81EA;&#x5DF1;&#x7684;&#x7B2C;&#x4E00;&#x6B3E;app&#x9879;&#x76EE;&#xFF0C;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x65B9;&#x9762;0&#x3002;0&#xFF08;&#x661F;&#x9645;2&#x4E0A;&#x4E00;&#x4E2A;&#x5927;&#x5E08;&#xFF09;&#x3002;<br>&#x672C;&#x5468;&#x4E5F;&#x5C31;&#x662F;10.24&#x53F7;&#x5F00;&#x59CB;&#x5B9E;&#x8BAD;&#xFF0C;&#x505A;&#x4E00;&#x4E2A;&#x7F51;&#x4E0A;&#x8BA2;&#x9910;&#x7CFB;&#x7EDF;&#xFF0C;&#x8BDD;&#x8BF4;web&#x9879;&#x76EE;&#x771F;&#x7684;&#x662F;&#x505A;&#x4E86;&#x597D;&#x591A;&#x6B21;&#x4E86;- -&#xFF0C;&#x4E0D;&#x8FC7;&#x4E00;&#x6B21;&#x6BD4;&#x4E00;&#x6B21;&#x89C4;&#x8303;&#xFF0C;&#x8FD9;&#x4E00;&#x6B21;&#x4E0D;&#x4EC5;&#x4EC5;&#x6587;&#x6863;&#x5199;&#x7684;&#x66F4;&#x597D;&#xFF0C;&#x800C;&#x4E14;&#x539F;&#x578B;&#x56FE;&#x4E5F;&#x66F4;&#x52A0;&#x6B63;&#x89C4;&#xFF0C;&#x4EFB;&#x52A1;&#x7684;&#x5206;&#x914D;&#x4E5F;&#x66F4;&#x79D1;&#x5B66;&#x4E86;&#x3002;<br>&#x9879;&#x76EE;&#x7684;&#x8BBE;&#x8BA1;&#x771F;&#x7684;&#x662F;&#x5F88;&#x8003;&#x9A8C;&#x4EBA;&#xFF0C;&#x4E0D;&#x4EC5;&#x8981;&#x8003;&#x8651;&#x529F;&#x80FD;&#xFF0C;&#x4E5F;&#x8981;&#x8003;&#x8651;ui&#x754C;&#x9762;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x7528;&#x6237;&#x4EA4;&#x4E92;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;wow&#xFF0C;It&#x2019;s cool.</p>
<p>ps&#xFF1A;10&#x6708;&#x4EFD; &#x575A;&#x6301;&#x4E86;&#x534A;&#x4E2A;&#x6708;&#x7684;&#x5409;&#x4ED6;&#xFF0C;&#x5DE6;&#x624B;&#x7684;&#x6307;&#x809A;&#x7EC8;&#x4E8E;&#x8D77;&#x8327;&#x4E86; &#x1F604;&#xFF0C;&#x7136;&#x800C;&#x5BA4;&#x53CB;&#x56DE;&#x5B66;&#x6821;&#xFF0C;&#x6211;&#x53C8;&#x4E0D;&#x60F3;&#x7EC3;&#x5409;&#x4ED6;&#x4E86;- -&#xFF0C;&#x53EA;&#x80FD;&#x5BA4;&#x53CB;&#x79BB;&#x6821;&#x518D;&#x7EC3;&#x4E86;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/09/28/yymodel/" rel="next" title="YYModel解析（2）">
                <i class="fa fa-chevron-left"></i> YYModel解析（2）
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.gif"
               alt="Motom" />
          <p class="site-author-name" itemprop="name">Motom</p>
          <p class="site-description motion-element" itemprop="description">Hi! 欢迎来到我的博客，希望这里的知识能够帮助到你！</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">3</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          

          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#title-2016年下半年／2总结"><span class="nav-number">1.</span> <span class="nav-text">title:2016年下半年／2总结</span></a></li></ol></li><li class="nav-item nav-level-1"><a class="nav-link" href="#前言"><span class="nav-number"></span> <span class="nav-text">前言</span></a></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Motom</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Muse
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  



  




  
  

  

  

  

</body>
</html>
